In [1]:
import numpy as np
import pandas as pd

In [2]:
indexes = ['Iran','b','c']
list_py = [10,20,30]
dic = {'a':10 , 'b':20 , 'c':30}

In [3]:
sample = pd.Series(list_py,indexes)

In [4]:
sample

Iran    10
b       20
c       30
dtype: int64

In [5]:
covid19_data = pd.Series(data = [2000,400,1220,587,54789], index = ['Iran' , 'Usa' , 'India' , 'China' , 'France'])

In [6]:
covid19_data * 2

Iran        4000
Usa          800
India       2440
China       1174
France    109578
dtype: int64

In [7]:
covid19_data + sample

China        NaN
France       NaN
India        NaN
Iran      2010.0
Usa          NaN
b            NaN
c            NaN
dtype: float64

In [8]:
columns = ['Q','W','E','R','T']

In [9]:
index = ['A','B','C','D']

In [10]:
data = np.random.randint(-100 , 100 ,  (4,5))

In [11]:
data

array([[ 65,  31, -54,  51, -44],
       [ 16, -78,  50,  32,  27],
       [-58, -79, -79,  89,  25],
       [ 52,  -4,  83,  95, -14]])

In [12]:
df = pd.DataFrame(data,index,columns)

In [13]:
df

    Q   W   E   R   T
A  65  31 -54  51 -44
B  16 -78  50  32  27
C -58 -79 -79  89  25
D  52  -4  83  95 -14

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df['W']

A    31
B   -78
C   -79
D    -4
Name: W, dtype: int32

In [16]:
type(df['Q'])

pandas.core.series.Series

In [17]:
df['new columns'] = df['Q'] + df["W"]

In [18]:
df

    Q   W   E   R   T  new columns
A  65  31 -54  51 -44           96
B  16 -78  50  32  27          -62
C -58 -79 -79  89  25         -137
D  52  -4  83  95 -14           48

In [19]:
df.drop('Q', axis = 1)

    W   E   R   T  new columns
A  31 -54  51 -44           96
B -78  50  32  27          -62
C -79 -79  89  25         -137
D  -4  83  95 -14           48

In [20]:
df

    Q   W   E   R   T  new columns
A  65  31 -54  51 -44           96
B  16 -78  50  32  27          -62
C -58 -79 -79  89  25         -137
D  52  -4  83  95 -14           48

In [21]:
df = df.drop('Q',axis=1)

In [22]:
df

    W   E   R   T  new columns
A  31 -54  51 -44           96
B -78  50  32  27          -62
C -79 -79  89  25         -137
D  -4  83  95 -14           48

In [23]:
df.loc['A']

W              31
E             -54
R              51
T             -44
new columns    96
Name: A, dtype: int32

In [24]:
type(df.loc[['A','B']])

pandas.core.frame.DataFrame

In [25]:
df.loc[["A","B"]]

    W   E   R   T  new columns
A  31 -54  51 -44           96
B -78  50  32  27          -62

In [26]:
df_new = df.drop('A')

In [27]:
df_new

    W   E   R   T  new columns
B -78  50  32  27          -62
C -79 -79  89  25         -137
D  -4  83  95 -14           48

In [28]:
df.iloc[0:2,2:]

    R   T  new columns
A  51 -44           96
B  32  27          -62

In [29]:
df.loc[['A','B'],['W','new columns']]

    W  new columns
A  31           96
B -78          -62

In [30]:
df.iloc[-1:,-1:]

   new columns
D           48

In [31]:
df.iloc[-1:]

   W   E   R   T  new columns
D -4  83  95 -14           48

In [32]:
df

    W   E   R   T  new columns
A  31 -54  51 -44           96
B -78  50  32  27          -62
C -79 -79  89  25         -137
D  -4  83  95 -14           48

In [33]:
df >= 0

       W      E     R      T  new columns
A   True  False  True  False         True
B  False   True  True   True        False
C  False  False  True   True        False
D  False   True  True  False         True

In [34]:
df[df >= 0]

      W     E   R     T  new columns
A  31.0   NaN  51   NaN         96.0
B   NaN  50.0  32  27.0          NaN
C   NaN   NaN  89  25.0          NaN
D   NaN  83.0  95   NaN         48.0

In [35]:
df[df['W'] > 0].iloc[:1]

    W   E   R   T  new columns
A  31 -54  51 -44           96

In [36]:
df.columns

Index(['W', 'E', 'R', 'T', 'new columns'], dtype='object')

In [37]:
df[(df['W'] > 1) & (df['new columns'] >= 0)]

    W   E   R   T  new columns
A  31 -54  51 -44           96

In [38]:
df.reset_index()

  index   W   E   R   T  new columns
0     A  31 -54  51 -44           96
1     B -78  50  32  27          -62
2     C -79 -79  89  25         -137
3     D  -4  83  95 -14           48

In [39]:
index_states = ['Bastam', 'Shahrood', 'Bonab', 'Tabriz']

In [40]:
df['States'] = index_states

In [41]:
df = df.set_index('States')

In [42]:
df

           W   E   R   T  new columns
States
Bastam    31 -54  51 -44           96
Shahrood -78  50  32  27          -62
Bonab    -79 -79  89  25         -137
Tabriz    -4  83  95 -14           48

In [43]:
df.describe()

              W          E          R          T  new columns
count   4.00000   4.000000   4.000000   4.000000     4.000000
mean  -32.50000   0.000000  66.750000  -1.500000   -13.750000
std    55.00606  78.625696  30.269622  34.044089   105.477881
min   -79.00000 -79.000000  32.000000 -44.000000  -137.000000
25%   -78.25000 -60.250000  46.250000 -21.500000   -80.750000
50%   -41.00000  -2.000000  70.000000   5.500000    -7.000000
75%     4.75000  58.250000  90.500000  25.500000    60.000000
max    31.00000  83.000000  95.000000  27.000000    96.000000

In [44]:
df.dtypes

W              int32
E              int32
R              int32
T              int32
new columns    int32
dtype: object

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Bastam to Tabriz
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   W            4 non-null      int32
 1   E            4 non-null      int32
 2   R            4 non-null      int32
 3   T            4 non-null      int32
 4   new columns  4 non-null      int32
dtypes: int32(5)
memory usage: 112.0+ bytes

In [46]:
df

           W   E   R   T  new columns
States
Bastam    31 -54  51 -44           96
Shahrood -78  50  32  27          -62
Bonab    -79 -79  89  25         -137
Tabriz    -4  83  95 -14           48

In [47]:
df['E'][2] = np.nan
df['E'][3] = np.nan
df['W'][0] = np.nan
df['W'][1] = np.nan
df['W'][2] = np.nan

C:\Users\Yasin\AppData\Local\Temp\ipykernel_6424\1910374095.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['W'][0] = np.nan

In [48]:
df

            W     E   R   T  new columns
States
Bastam    NaN -54.0  51 -44           96
Shahrood  NaN  50.0  32  27          -62
Bonab     NaN   NaN  89  25         -137
Tabriz   -4.0   NaN  95 -14           48

In [49]:
# axis = 1 means delete column 
# thresh means at least valid data in any coulmn need to not delete
df.dropna(axis=1, thresh = 2)

             E   R   T  new columns
States
Bastam   -54.0  51 -44           96
Shahrood  50.0  32  27          -62
Bonab      NaN  89  25         -137
Tabriz     NaN  95 -14           48

In [50]:
df.fillna(value = 'unavailable')

                    W            E   R   T  new columns
States
Bastam    unavailable        -54.0  51 -44           96
Shahrood  unavailable         50.0  32  27          -62
Bonab     unavailable  unavailable  89  25         -137
Tabriz           -4.0  unavailable  95 -14           48

In [51]:
df['E'] = df['E'].fillna(value=df['E'].mean())

In [52]:
df

            W     E   R   T  new columns
States
Bastam    NaN -54.0  51 -44           96
Shahrood  NaN  50.0  32  27          -62
Bonab     NaN  -2.0  89  25         -137
Tabriz   -4.0  -2.0  95 -14           48

In [53]:
df['W'] = df['W'].fillna(value = 0 )

In [54]:
df

            W     E   R   T  new columns
States
Bastam    0.0 -54.0  51 -44           96
Shahrood  0.0  50.0  32  27          -62
Bonab     0.0  -2.0  89  25         -137
Tabriz   -4.0  -2.0  95 -14           48

In [55]:
df_csv = pd.read_csv('\\py practice\\Exercise Notebooks\\Data\\Universities.csv')

In [56]:
df_csv.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [57]:
df_csv.groupby('Year').sum().sort_index(ascending=False)

,Sector,University,Completions,Geography
Year,,,,
2016,"Private for-profit, 2-yearPrivate for-profit, ...",Pima Medical Institute-Las VegasHealthcare Pre...,26224,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2015,"Private for-profit, 2-yearPrivate not-for-prof...",Pima Medical Institute-Las VegasRoseman Univer...,26279,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2014,"Private not-for-profit, 4-year or abovePrivate...",Roseman University of Health SciencesExpertise...,24730,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2013,"Private for-profit, 2-yearPrivate for-profit, ...",Aviation Institute of Maintenance-Las VegasDeV...,21046,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2012,"Private for-profit, less-than 2-yearPrivate fo...",Academy of Hair Design-Las VegasCareer College...,20333,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...

In [58]:
df_csv.groupby(['Year','University']).sum().sort_index(ascending=False).transpose()

Year                                            2016                           \
University     Wongu University of Oriental Medicine   Western Nevada College
Sector       Private not-for-profit, 4-year or above  Public, 4-year or above
Completions                                        0                      960
Geography                                     Nevada                   Nevada

Year                                               \
University  Utah College of Massage Therapy-Vegas
Sector       Private for-profit, less-than 2-year
Completions                                   240
Geography                                  Nevada

Year                                                                        \
University          University of Phoenix-Nevada University of Nevada-Reno
Sector       Private for-profit, 4-year or above   Public, 4-year or above
Completions                                  423                      4309
Geography                                 Nevada                    Nevada

Year                                                                          \
University  University of Nevada-Las Vegas Truckee Meadows Community College
Sector             Public, 4-year or above                    Public, 2-year
Completions                           5367                              2431
Geography                           Nevada                            Nevada

Year                                                  \
University                   Touro University Nevada
Sector       Private not-for-profit, 4-year or above
Completions                                      356
Geography                                     Nevada

Year                                              \
University        The Art Institute of Las Vegas
Sector       Private for-profit, 4-year or above
Completions                                  135
Geography                                 Nevada

Year                                                  ...  \
University                     Sierra Nevada College  ...
Sector       Private not-for-profit, 4-year or above  ...
Completions                                      261  ...
Geography                                     Nevada  ...

Year                                                          2012  \
University  Euphoria Institute of Beauty Arts & Sciences-Summerlin
Sector                              Private for-profit, 2-year
Completions                                                113
Geography                                               Nevada

Year                                                                   \
University  Euphoria Institute of Beauty Arts & Sciences-Green Valley
Sector                              Private for-profit, 2-year
Completions                                                153
Geography                                               Nevada

Year                                                                \
University  College of Southern Nevada   Casal Institute of Nevada
Sector         Public, 4-year or above  Private for-profit, 2-year
Completions                       2348                          87
Geography                       Nevada                      Nevada

Year                                                                  \
University      Carrington College-Reno Carrington College-Las Vegas
Sector       Private for-profit, 2-year   Private for-profit, 2-year
Completions                         145                          120
Geography                        Nevada                       Nevada

Year                                                                        \
University  Career College of Northern Nevada Brightwood College-Las Vegas
Sector             Private for-profit, 2-year   Private for-profit, 2-year
Completions                               333                          568
Geography                              Nevada                       Nevada

Year                                               \
University            Advanced Training Institute
Sector       Private for-profit, less-than 2-year
Completions                                   218
Geography                                  Nevada

Year
University       Academy of Hair Design-Las Vegas
Sector       Private for-profit, less-than 2-year
Completions                                   110
Geography                                  Nevada

[3 rows x 207 columns]

In [59]:
df_csv.groupby(['University','Year']).describe().transpose()

University        Academy of Hair Design-Las Vegas                             \
Year                                          2012  2013   2014   2015   2016
Completions count                              1.0   1.0    1.0    1.0    1.0
            mean                             110.0  84.0  256.0  180.0  124.0
            std                                NaN   NaN    NaN    NaN    NaN
            min                              110.0  84.0  256.0  180.0  124.0
            25%                              110.0  84.0  256.0  180.0  124.0
            50%                              110.0  84.0  256.0  180.0  124.0
            75%                              110.0  84.0  256.0  180.0  124.0
            max                              110.0  84.0  256.0  180.0  124.0

University        Advanced Training Institute                              \
Year                                     2012   2013   2014   2015   2016
Completions count                         1.0    1.0    1.0    1.0    1.0
            mean                        218.0  157.0  147.0  266.0  372.0
            std                           NaN    NaN    NaN    NaN    NaN
            min                         218.0  157.0  147.0  266.0  372.0
            25%                         218.0  157.0  147.0  266.0  372.0
            50%                         218.0  157.0  147.0  266.0  372.0
            75%                         218.0  157.0  147.0  266.0  372.0
            max                         218.0  157.0  147.0  266.0  372.0

University         ... Utah College of Massage Therapy-Vegas                \
Year               ...                                  2013   2014   2015
Completions count  ...                                   1.0    1.0    1.0
            mean   ...                                 372.0  290.0  316.0
            std    ...                                   NaN    NaN    NaN
            min    ...                                 372.0  290.0  316.0
            25%    ...                                 372.0  290.0  316.0
            50%    ...                                 372.0  290.0  316.0
            75%    ...                                 372.0  290.0  316.0
            max    ...                                 372.0  290.0  316.0

University               Western Nevada College                              \
Year                2016                   2012   2013   2014   2015   2016
Completions count    1.0                    1.0    1.0    1.0    1.0    1.0
            mean   240.0                  495.0  522.0  842.0  925.0  960.0
            std      NaN                    NaN    NaN    NaN    NaN    NaN
            min    240.0                  495.0  522.0  842.0  925.0  960.0
            25%    240.0                  495.0  522.0  842.0  925.0  960.0
            50%    240.0                  495.0  522.0  842.0  925.0  960.0
            75%    240.0                  495.0  522.0  842.0  925.0  960.0
            max    240.0                  495.0  522.0  842.0  925.0  960.0

University        Wongu University of Oriental Medicine
Year                                               2016
Completions count                                   1.0
            mean                                    0.0
            std                                     NaN
            min                                     0.0
            25%                                     0.0
            50%                                     0.0
            75%                                     0.0
            max                                     0.0

[8 rows x 207 columns]

In [60]:
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})

In [61]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [62]:
df_one['k1'].unique()

array(['A', 'B', 'C'], dtype=object)

In [63]:
df_one['k1'].nunique()

3

In [64]:
df_one['col2'].value_counts()

col2
WA    2
NY    1
CA    1
AK    1
NV    1
Name: count, dtype: int64

In [65]:
df_one['k1'].drop_duplicates()

0    A
2    B
4    C
Name: k1, dtype: object

In [66]:
df_one["col3"] = df_one['col1'] * 2

In [67]:
df_one

  k1  col1 col2  col3
0  A   100   NY   200
1  A   200   CA   400
2  B   300   WA   600
3  B   300   WA   600
4  C   400   AK   800
5  C   500   NV  1000

In [68]:
def first_letter(str):
    return str[0]

In [69]:
df_one['first letter of col1'] = df_one['col2'].apply(first_letter)

In [70]:
df_one

  k1  col1 col2  col3 first letter of col1
0  A   100   NY   200                    N
1  A   200   CA   400                    C
2  B   300   WA   600                    W
3  B   300   WA   600                    W
4  C   400   AK   800                    A
5  C   500   NV  1000                    N

In [71]:
df

            W     E   R   T  new columns
States
Bastam    0.0 -54.0  51 -44           96
Shahrood  0.0  50.0  32  27          -62
Bonab     0.0  -2.0  89  25         -137
Tabriz   -4.0  -2.0  95 -14           48

In [72]:
def complex_letter(str):
    if str == 'W':
        return "washington dc"
    else:
        return "unknown"

In [73]:
df_one['first letter of col1'].apply(complex_letter)

0          unknown
1          unknown
2    washington dc
3    washington dc
4          unknown
5          unknown
Name: first letter of col1, dtype: object

In [74]:
df_one['complex letter of col1'] = df_one['first letter of col1'].apply(complex_letter)

In [75]:
df_one

  k1  col1 col2  col3 first letter of col1 complex letter of col1
0  A   100   NY   200                    N                unknown
1  A   200   CA   400                    C                unknown
2  B   300   WA   600                    W          washington dc
3  B   300   WA   600                    W          washington dc
4  C   400   AK   800                    A                unknown
5  C   500   NV  1000                    N                unknown

In [76]:
df_one['complex letter of col1'].drop_duplicates()

0          unknown
2    washington dc
Name: complex letter of col1, dtype: object

In [77]:
df_one['drop_duplicates'] = df_one['complex letter of col1'].drop_duplicates()

In [78]:
df_one

,k1,col1,col2,col3,first letter of col1,complex letter of col1,drop_duplicates
0,A,100,NY,200,N,unknown,unknown
1,A,200,CA,400,C,unknown,NaN
2,B,300,WA,600,W,washington dc,washington dc
3,B,300,WA,600,W,washington dc,NaN
4,C,400,AK,800,A,unknown,NaN
5,C,500,NV,1000,N,unknown,NaN

In [79]:
my_map = {np.nan:0,'washington dc' : 'washington dc','unknown': 1}

In [80]:
df_one['drop_duplicates'] = df_one['drop_duplicates'].map(my_map)

In [81]:
df_one

,k1,col1,col2,col3,first letter of col1,complex letter of col1,drop_duplicates
0,A,100,NY,200,N,unknown,1
1,A,200,CA,400,C,unknown,0
2,B,300,WA,600,W,washington dc,washington dc
3,B,300,WA,600,W,washington dc,0
4,C,400,AK,800,A,unknown,0
5,C,500,NV,1000,N,unknown,0

In [82]:
df

            W     E   R   T  new columns
States
Bastam    0.0 -54.0  51 -44           96
Shahrood  0.0  50.0  32  27          -62
Bonab     0.0  -2.0  89  25         -137
Tabriz   -4.0  -2.0  95 -14           48

In [83]:
pd.concat([df_one,df],axis=1)

,k1,col1,col2,col3,first letter of col1,complex letter of col1,drop_duplicates,W,E,R,T,new columns
0,A,100.0,NY,200.0,N,unknown,1,NaN,NaN,NaN,NaN,NaN
1,A,200.0,CA,400.0,C,unknown,0,NaN,NaN,NaN,NaN,NaN
2,B,300.0,WA,600.0,W,washington dc,washington dc,NaN,NaN,NaN,NaN,NaN
3,B,300.0,WA,600.0,W,washington dc,0,NaN,NaN,NaN,NaN,NaN
4,C,400.0,AK,800.0,A,unknown,0,NaN,NaN,NaN,NaN,NaN
5,C,500.0,NV,1000.0,N,unknown,0,NaN,NaN,NaN,NaN,NaN
Bastam,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,-54.0,51.0,-44.0,96.0
Shahrood,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,50.0,32.0,27.0,-62.0
Bonab,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,-2.0,89.0,25.0,-137.0
Tabriz,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-4.0,-2.0,95.0,-14.0,48.0

In [84]:
df.max()

W               0.0
E              50.0
R              95.0
T              27.0
new columns    96.0
dtype: float64

In [85]:
# show index of max data in column
df.idxmax()

W                Bastam
E              Shahrood
R                Tabriz
T              Shahrood
new columns      Bastam
dtype: object

In [86]:
df_one['col3'].max()

1000

In [87]:
df_one['col3'].idxmax()

5

In [88]:
df_one

,k1,col1,col2,col3,first letter of col1,complex letter of col1,drop_duplicates
0,A,100,NY,200,N,unknown,1
1,A,200,CA,400,C,unknown,0
2,B,300,WA,600,W,washington dc,washington dc
3,B,300,WA,600,W,washington dc,0
4,C,400,AK,800,A,unknown,0
5,C,500,NV,1000,N,unknown,0

In [89]:
df_one.sort_values('col2',ascending=False)

,k1,col1,col2,col3,first letter of col1,complex letter of col1,drop_duplicates
2,B,300,WA,600,W,washington dc,washington dc
3,B,300,WA,600,W,washington dc,0
0,A,100,NY,200,N,unknown,1
5,C,500,NV,1000,N,unknown,0
1,A,200,CA,400,C,unknown,0
4,C,400,AK,800,A,unknown,0

In [90]:
df_one.columns

Index(['k1', 'col1', 'col2', 'col3', 'first letter of col1',
       'complex letter of col1', 'drop_duplicates'],
      dtype='object')

In [91]:
df_one.columns = ['c0','c1','c2','c3','c4','c5','c6']

In [92]:
df_one

  c0   c1  c2    c3 c4             c5             c6
0  A  100  NY   200  N        unknown              1
1  A  200  CA   400  C        unknown              0
2  B  300  WA   600  W  washington dc  washington dc
3  B  300  WA   600  W  washington dc              0
4  C  400  AK   800  A        unknown              0
5  C  500  NV  1000  N        unknown              0

In [93]:
df_one['c2']

0    NY
1    CA
2    WA
3    WA
4    AK
5    NV
Name: c2, dtype: object

In [94]:
pd.get_dummies(df_one['c2'])

      AK     CA     NV     NY     WA
0  False  False  False   True  False
1  False   True  False  False  False
2  False  False  False  False   True
3  False  False  False  False   True
4   True  False  False  False  False
5  False  False   True  False  False

In [95]:
pd.get_dummies(df['R'])

             32     51     89     95
States
Bastam    False   True  False  False
Shahrood   True  False  False  False
Bonab     False  False   True  False
Tabriz    False  False  False   True

In [96]:
pwd

'D:\\py practice\\Exercise Notebooks'

In [97]:
ls

 Volume in drive D is Data
 Volume Serial Number is B4EF-B54C

 Directory of D:\py practice\Exercise Notebooks

02/02/2024  10:51 PM    <DIR>          .
02/02/2024  10:51 PM    <DIR>          ..
02/02/2024  10:01 PM    <DIR>          .ipynb_checkpoints
02/02/2024  10:06 PM    <DIR>          Data
01/26/2024  06:10 PM            39,195 Loading_The_MNIST_Dataset.ipynb
01/29/2024  03:28 AM            22,868 Numpy_Exercises_From_Udemy_Course.ipynb
02/02/2024  10:51 PM            54,986 Pandas_Exercises_From_Udemy_Course.ipynb
01/29/2024  10:16 PM            22,117 Playing_With_Numpy_Library.ipynb
02/01/2024  07:35 PM           226,740 Playing_With_Pandas_Library.ipynb
               5 File(s)        365,906 bytes
               4 Dir(s)  158,254,215,168 bytes free

In [98]:
df

            W     E   R   T  new columns
States
Bastam    0.0 -54.0  51 -44           96
Shahrood  0.0  50.0  32  27          -62
Bonab     0.0  -2.0  89  25         -137
Tabriz   -4.0  -2.0  95 -14           48

In [99]:
df.to_csv('\\py practice\\Exercise Notebooks\\Data\\outputfromDataFrame.csv',index=False)

In [100]:
df_read = pd.read_csv('\\py practice\\Exercise Notebooks\\Data\\outputfromDataFrame.csv')

In [101]:
df_read

     W     E   R   T  new columns
0  0.0 -54.0  51 -44           96
1  0.0  50.0  32  27          -62
2  0.0  -2.0  89  25         -137
3 -4.0  -2.0  95 -14           48

In [102]:
df.to_csv('\\py practice\\Exercise Notebooks\\Data\\outputfromDataFramewithindex.csv')

In [103]:
df_read_index = pd.read_csv('\\py practice\\Exercise Notebooks\\Data\\outputfromDataFramewithindex.csv')

In [104]:
df_read_index

     States    W     E   R   T  new columns
0    Bastam  0.0 -54.0  51 -44           96
1  Shahrood  0.0  50.0  32  27          -62
2     Bonab  0.0  -2.0  89  25         -137
3    Tabriz -4.0  -2.0  95 -14           48

In [117]:
tables = pd.read_html('https://shahroodut.ac.ir/en/schools/index.php?id=S001&index=1000')

In [118]:
type(tables)

list

In [119]:
tables

[               Information                                 Google Scholar  \
                       Name        Academic Rank  Citations        h-index
 0           Mohsen Farhadi           Instructor        NaN            NaN
 1       Hossein Morshedlou                     NaN            NaN
 2           Alireza Tajary  Assistant Professor         87              4
 3      Fatemeh Jafarinejad                  NaN         47              4
 4       Maryam Khodabakhsh  Assistant Professor         90              5
 5           Marziea Rahimi                  NaN         45              5
 6         Esmaeel Tahanian  Assistant Professor         87              6
 7            Mansoor Fateh                  NaN        316             10
 8          Hoda Mashayekhi  Associate Professor       1144             13
 9           Mohsen Rezvani  Associate Professor        775             14
 10          Morteza Zahedi  Assistant Professor       1233             17
 11  Prof. Hamid Hassanpour            Professor       3578             30
 12                    Name        Academic Rank  Citations        h-index

                                        Scopus                         \
     i10-index  Co-authors  Citations  h-index  Documents  Co-authors
 0         NaN         NaN        NaN      NaN        NaN         NaN
 1         NaN         NaN        NaN      NaN        NaN         NaN
 2           3           5         60        4         14          14
 3           2           0         25        3          7           7
 4           4           2         64        4          9           8
 5           1           0         25        4          7           5
 6           1           6         51        5          8           4
 7          10          18          0        0          0           0
 8          16          10        649       11         35          46
 9          20           0        483       11         44          51
 10         25           0        459       12         52          46
 11         90          14       1717       21        168         139
 12  i10-index  Co-authors  Citations  h-index  Documents  Co-authors


    Unnamed: 10_level_1
 0                  1.0
 1                  0.0
 2                  2.0
 3                  0.0
 4                  2.0
 5                  0.0
 6                  2.0
 7                  0.0
 8                  3.0
 9                  3.0
 10                 2.0
 11                 4.0
 12                 NaN  ]

In [121]:
type(tables[0])

pandas.core.frame.DataFrame

In [122]:
tables[0]

               Information                                 Google Scholar  \
                      Name        Academic Rank  Citations        h-index
0           Mohsen Farhadi           Instructor        NaN            NaN
1       Hossein Morshedlou                     NaN            NaN
2           Alireza Tajary  Assistant Professor         87              4
3      Fatemeh Jafarinejad                  NaN         47              4
4       Maryam Khodabakhsh  Assistant Professor         90              5
5           Marziea Rahimi                  NaN         45              5
6         Esmaeel Tahanian  Assistant Professor         87              6
7            Mansoor Fateh                  NaN        316             10
8          Hoda Mashayekhi  Associate Professor       1144             13
9           Mohsen Rezvani  Associate Professor        775             14
10          Morteza Zahedi  Assistant Professor       1233             17
11  Prof. Hamid Hassanpour            Professor       3578             30
12                    Name        Academic Rank  Citations        h-index

                                       Scopus                         \
    i10-index  Co-authors  Citations  h-index  Documents  Co-authors
0         NaN         NaN        NaN      NaN        NaN         NaN
1         NaN         NaN        NaN      NaN        NaN         NaN
2           3           5         60        4         14          14
3           2           0         25        3          7           7
4           4           2         64        4          9           8
5           1           0         25        4          7           5
6           1           6         51        5          8           4
7          10          18          0        0          0           0
8          16          10        649       11         35          46
9          20           0        483       11         44          51
10         25           0        459       12         52          46
11         90          14       1717       21        168         139
12  i10-index  Co-authors  Citations  h-index  Documents  Co-authors


   Unnamed: 10_level_1
0                  1.0
1                  0.0
2                  2.0
3                  0.0
4                  2.0
5                  0.0
6                  2.0
7                  0.0
8                  3.0
9                  3.0
10                 2.0
11                 4.0
12                 NaN

In [123]:
tables[0].sort_index(ascending=False).transpose().drop_duplicates()

                                               12                      11  \
Information    Name                          Name  Prof. Hamid Hassanpour
               Academic Rank        Academic Rank               Professor
               Citations                Citations                    3578
Google Scholar h-index                    h-index                      30
               i10-index                i10-index                      90
               Co-authors              Co-authors                      14
               Citations                Citations                    1717
Scopus         h-index                    h-index                      21
               Documents                Documents                     168
               Co-authors              Co-authors                     139
               Unnamed: 10_level_1            NaN                     4.0

                                                     10                   9   \
Information    Name                      Morteza Zahedi       Mohsen Rezvani
               Academic Rank        Assistant Professor  Associate Professor
               Citations                           1233                  775
Google Scholar h-index                               17                   14
               i10-index                             25                   20
               Co-authors                             0                    0
               Citations                            459                  483
Scopus         h-index                               12                   11
               Documents                             52                   44
               Co-authors                            46                   51
               Unnamed: 10_level_1                  2.0                  3.0

                                                     8              7   \
Information    Name                     Hoda Mashayekhi  Mansoor Fateh
               Academic Rank        Associate Professor            NaN
               Citations                           1144            316
Google Scholar h-index                               13             10
               i10-index                             16             10
               Co-authors                            10             18
               Citations                            649              0
Scopus         h-index                               11              0
               Documents                             35              0
               Co-authors                            46              0
               Unnamed: 10_level_1                  3.0            0.0

                                                     6               5   \
Information    Name                    Esmaeel Tahanian  Marziea Rahimi
               Academic Rank        Assistant Professor             NaN
               Citations                             87              45
Google Scholar h-index                                6               5
               i10-index                              1               1
               Co-authors                             6               0
               Citations                             51              25
Scopus         h-index                                5               4
               Documents                              8               7
               Co-authors                             4               5
               Unnamed: 10_level_1                  2.0             0.0

                                                     4                    3   \
Information    Name                  Maryam Khodabakhsh  Fatemeh Jafarinejad
               Academic Rank        Assistant Professor                  NaN
               Citations                             90                   47
Google Scholar h-index                                5                    4
               i10-index                              4                    2
               Co-authors                             2                    0
               Citations                             64                   25
Scopus         h-index                                4                    3
               Documents                              9                    7
               Co-authors                             8                    7
               Unnamed: 10_level_1                  2.0                  0.0

                                                     2                   1   \
Information    Name                      Alireza Tajary  Hossein Morshedlou
               Academic Rank        Assistant Professor
               Citations                             87                 NaN
Google Scholar h-index                                4                 NaN
               i10-index                              3                 NaN
               Co-authors                             5                 NaN
               Citations                             60                 NaN
Scopus         h-index                                4                 NaN
               Documents                             14                 NaN
               Co-authors                            14                 NaN
               Unnamed: 10_level_1                  2.0                 0.0

                                                0
Information    Name                 Mohsen Farhadi
               Academic Rank            Instructor
               Citations                       NaN
Google Scholar h-index                         NaN
               i10-index                       NaN
               Co-authors                      NaN
               Citations                       NaN
Scopus         h-index                         NaN
               Documents                       NaN
               Co-authors                      NaN
               Unnamed: 10_level_1             1.0

In [124]:
df_uni = tables[0]

In [125]:
df_uni["Shahrood University Of Technology"] = np.arange(12,-1,-1)

In [126]:
df_uni = df_uni.set_index('Shahrood University Of Technology').sort_index()

In [127]:
df_uni

                                              Information  \
                                                     Name
Shahrood University Of Technology
0                                                    Name
1                                  Prof. Hamid Hassanpour
2                                          Morteza Zahedi
3                                          Mohsen Rezvani
4                                         Hoda Mashayekhi
5                                           Mansoor Fateh
6                                        Esmaeel Tahanian
7                                          Marziea Rahimi
8                                      Maryam Khodabakhsh
9                                     Fatemeh Jafarinejad
10                                         Alireza Tajary
11                                     Hossein Morshedlou
12                                         Mohsen Farhadi

                                                                   \
                                         Academic Rank  Citations
Shahrood University Of Technology
0                                        Academic Rank  Citations
1                                            Professor       3578
2                                  Assistant Professor       1233
3                                  Associate Professor        775
4                                  Associate Professor       1144
5                                                  NaN        316
6                                  Assistant Professor         87
7                                                  NaN         45
8                                  Assistant Professor         90
9                                                  NaN         47
10                                 Assistant Professor         87
11                                                    NaN
12                                          Instructor        NaN

                                  Google Scholar                         \
                                         h-index  i10-index  Co-authors
Shahrood University Of Technology
0                                        h-index  i10-index  Co-authors
1                                             30         90          14
2                                             17         25           0
3                                             14         20           0
4                                             13         16          10
5                                             10         10          18
6                                              6          1           6
7                                              5          1           0
8                                              5          4           2
9                                              4          2           0
10                                             4          3           5
11                                           NaN        NaN         NaN
12                                           NaN        NaN         NaN

                                               Scopus                         \
                                   Citations  h-index  Documents  Co-authors
Shahrood University Of Technology
0                                  Citations  h-index  Documents  Co-authors
1                                       1717       21        168         139
2                                        459       12         52          46
3                                        483       11         44          51
4                                        649       11         35          46
5                                          0        0          0           0
6                                         51        5          8           4
7                                         25        4          7           5
8                                         64        4          9           8
9                                         25        3          7           7
10                                        60        4         14          14
11                                       NaN      NaN        NaN         NaN
12                                       NaN      NaN        NaN         NaN


                                  Unnamed: 10_level_1
Shahrood University Of Technology
0                                                 NaN
1                                                 4.0
2                                                 2.0
3                                                 3.0
4                                                 3.0
5                                                 0.0
6                                                 2.0
7                                                 0.0
8                                                 2.0
9                                                 0.0
10                                                2.0
11                                                0.0
12                                                1.0